## Valores nulos

### Entorno de trabajo
Importamos librerías $pandas$ y $numpy$, definimos un diccionario $dict$ y lo convertimos en un data frame $data$ con $pd.DataFrame()$.

In [13]:
import pandas as pd
import numpy as np

In [14]:
dict = {'Col1':[1,2,3,np.nan],'Col2':[4,np.nan,6,7],'Col3':['a','b','c',None]}

In [15]:
data = pd.DataFrame(dict)

In [16]:
data

   Col1  Col2  Col3
0   1.0   4.0     a
1   2.0   NaN     b
2   3.0   6.0     c
3   NaN   7.0  None

### Comprobar si un valor es nulo

#### $.isnull()$
Comprueba si un valor de una data frame es nulo y retorna true o false.
$$data.isnull()$$

In [17]:
data.isnull()

    Col1   Col2   Col3
0  False  False  False
1  False   True  False
2  False  False  False
3   True  False   True

Esta función se puede aplicar con valores numéricos: $0$ $False$ y $1$ $True$.
$$data.isnull()*1$$

In [18]:
data.isnull()*1

   Col1  Col2  Col3
0     0     0     0
1     0     1     0
2     0     0     0
3     1     0     1

#### $.fillna()$
Esta función permite cambiar los valores nulos por el parámetro introducido en la función.
$$data.fillna('\text{valor no nulo}')$$

In [19]:
data.fillna('vacío')

    Col1   Col2   Col3
0    1.0    4.0      a
1    2.0  vacío      b
2    3.0    6.0      c
3  vacío    7.0  vacío

Esta función también permite introducir algún valor estadístico como la media, mediana, varianza y una amplia variedad de datos.
$$data.fillna(data.f()).$$
$f()$ es la función que se le aplica a los datos del data frame.

### $.interpolate()$
Permite quitar valores nulos interpolando el valor uno a un valor numérico resultado de una interpolación. Es útil si los datos están estructurados de una manera determinada.
$$data.interpolate()$$

In [21]:
data.interpolate()

   Col1  Col2  Col3
0   1.0   4.0     a
1   2.0   5.0     b
2   3.0   6.0     c
3   3.0   7.0  None

### $.dropna()$
Elimina filas donde se encuentran datos nulos.
$$data.dropna()$$

In [22]:
data.dropna()

   Col1  Col2 Col3
0   1.0   4.0    a
2   3.0   6.0    c